[{"abstracts":"information from many popular databases, such as SQL Anywhere. Included with SQL Anywhere are modules that provide access to SQL Anywhere databases from PHP. You can use these modules and the PHP language to write stand-alone scripts and create dynamic web pages that rely on information stored in SQL Anywhere databases","date":"Apr 20, 2022","id":1,"title":"The SAP SQL Anywhere PHP Module","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/The+SAP+SQL+Anywhere+PHP+Module"},{"abstracts":"Purpose This tutorial demonstrates how to migrate a Microsoft SQL Server database to a SAP SQL Anywhere database. To migrate the schema and data, we use the Migration Wizard included with SQL Anywhere. To migrate database logic (store procedures, user-defined functions, and triggers), we perform slight modifications","date":"Jun 30, 2014","id":2,"title":"Migrating a SQL Server Database to SQL Anywhere","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/Migrating+a+SQL+Server+Database+to+SQL+Anywhere"},{"abstracts":"Visual Composer Version 7.00 SP10 Bug: The SQL-Editor in the BI-Kit does not always display the expected results in design time. The result in runtime might be correct though. Known workaround: To avoid bothing about design time issues, simply place a \"SELECT * FROM <table>\" statement in the SQL-Editor","date":"Feb 26, 2007","id":3,"title":"SQL-Statement does not work in SQL-Editor","url":"https://wiki.scn.sap.com/wiki/display/EP/SQL-Statement+does+not+work+in+SQL-Editor"},{"abstracts":"for the SQL Anywhere engineering team to address issues on operating systems that are no longer supported by the O/S vendor may be limited. The tables below summarize the platforms supported by SAP SQL Anywhere. The following information is available: SQL Anywhere for PC Platforms SQL Anywhere for Linux","date":"Apr 29, 2022","id":4,"title":"SAP SQL Anywhere Supported Platforms and Engineering Support Status","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/SAP+SQL+Anywhere+Supported+Platforms+and+Engineering+Support+Status"},{"abstracts":"Purpose The purpose of this page is to demonstrate how to set up a proxy table to a Microsoft SQL Server database in SQL Anywhere for remote data access. Overview This document will show how to set up a proxy table to a Microsoft SQL Server database in SQL Anywhere using Sybase Central or SQL statements from","date":"Jun 12, 2014","id":5,"title":"Setting Up a Proxy Table to Microsoft SQL Server in SQL Anywhere","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/Setting+Up+a+Proxy+Table+to+Microsoft+SQL+Server+in+SQL+Anywhere"},{"abstracts":"Purpose This WIKI discusses the SQL Central utilities and their command line equivalents. Introduction This document describes the most common utilities in SQL Anywhere 17. The purpose of this document is to give new users of SQL Anywhere 17 an understanding of both SQL Central wizards and command line utilities","date":"Aug 11, 2016","id":6,"title":"SQL Anywhere 17 SQL Central Utilities and Their Command Line Equivalents","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/SQL+Anywhere+17+SQL+Central+Utilities+and+Their+Command+Line+Equivalents"},{"abstracts":"SAP_AG.pngSAP® MaxDB - SQL Optimizer   This section gives detailed information about the SAP MaxDB SQL Optimizer. Moderator: Birgit Malik http://scn.sap.com/people/birgit.malik WIKI Space Editor: Thiago Lüttig http://scn.sap.com/people/thiago.luttig SQL statements describe the content criteria","date":"Dec 27, 2019","id":7,"title":"SQL Optimizer","url":"https://wiki.scn.sap.com/wiki/display/MaxDB/SQL+Optimizer"},{"abstracts":"HANA_SQL_StatementHash_SQLText  Displays the SQL associated with a specific statement hash. Input Parameters STATEMENT_HASH      LINE_LENGTH_TARGET Output Parameters SQL_TEXT: SQL text","date":"May 04, 2015","id":8,"title":"HANA SQL Statement Hash SQL Text","url":"https://wiki.scn.sap.com/wiki/display/SAPHANA/HANA+SQL+Statement+Hash+SQL+Text"},{"abstracts":"HANA_SQL_StatementHash_SQLCache_History SQL plan cache historical information. To identify times when large numbers of Plan Cache Evictions occur. Input … :     Hash value of SQL statement PLAN_ID:            SQL plan identifier HOST:               Host of statement execution ('various' if several hosts executed","date":"May 04, 2015","id":9,"title":"HANA SQL Statement Hash SQL Cache History","url":"https://wiki.scn.sap.com/wiki/display/SAPHANA/HANA+SQL+Statement+Hash+SQL+Cache+History"},{"abstracts":"The SQL Transform is really a workaround only. If you have a SQL statement at hand, maybe even one that cannot be rebuilt easily in DI, you just copy paste … singularization point In the meantime (DI 11.5) the SQL text can even include DI parameters, so you could write a SQL statement like \"select","date":"Mar 01, 2012","id":10,"title":"SQL Transform","url":"https://wiki.scn.sap.com/wiki/display/EIM/SQL+Transform"},{"abstracts":"engine128.pngThe SQL Anywhere Relational Database Management System (RDBMS) provides enterprise-caliber functionality including full transaction processing, referential integrity, materialized views, snapshot isolation, high availability via database mirroring and server clustering, SQL and Java stored procedures","date":"Feb 10, 2015","id":11,"title":"SQL Anywhere","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/SQL+Anywhere"},{"abstracts":"How would you like the ability to use an SQL result set just as if it were a standard table? Well, with the powerful combination of SQL and the TAdsQuery component you can. Advantage SQL and the Advantage TAdsQuery component provide a unique and extremely powerful approach to SQL development. How it works Advantage","date":"Nov 18, 2015","id":12,"title":"The SQL Advantage","url":"https://wiki.scn.sap.com/wiki/display/EIM/The+SQL+Advantage"},{"abstracts":"SQL stement Script collection for SAP IQ sap_iq sybase_iq sap tuning analytic sql SQL stement Script collection for SAP IQ","date":"Nov 23, 2017","id":13,"title":"SQL Statement IQ.zip","url":"https://wiki.scn.sap.com/wiki/display/SYBIQ/DBISQL+sql+stement+script+collection?preview=%2F481247583%2F481247584%2FSQL+Statement+IQ.zip"},{"abstracts":"The SAP SQL Anywhere Database Client includes the following components: Full set of available client interfaces, such as ODBC, JDBC, ADO.NET and so on. Administration tools such as SQL Central http://dcx.sap.com/index.html#sqla170/en/html/814e51506ce210148e23c405bed31f51.html and Interactive SQL","date":"Jan 06, 2022","id":14,"title":"SAP SQL Anywhere Database Client Download","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/SAP+SQL+Anywhere+Database+Client+Download"},{"abstracts":"SAP OEM Partners who wish to distribute the OEM Edition of SAP SQL Anywhere alongside their application must request an authentication signature for that application. To request this signature, you must have: An Account number or CBSS (Customer Bill-Ship-Sold To) number SAP SQL Anywhere OEM Edition in your SAP","date":"Jan 28, 2022","id":15,"title":"Requesting SAP SQL Anywhere Authentication Signatures","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/Requesting+SAP+SQL+Anywhere+Authentication+Signatures"},{"abstracts":"If PL/SQL scripts for the transformations are not an option as you loose too much database functionality like parallel processing and direct path operations, how can you do complex transformations then? Oracle Warehouse Builder provides you with the answer, you use nested SQL. So you write SQL statements like","date":"Feb 29, 2012","id":16,"title":"Nested SQL","url":"https://wiki.scn.sap.com/wiki/display/EIM/Nested+SQL"},{"abstracts":"1.  Open a SQL Editor window. 2.  Use the CREATE TABLE SQL statement to describe the table you want to create. 3.  Execute the SQL statement. HANA Information Modeler - SQL Editor - Create Table.JPG Migrated to Confluence 4.0","date":"Feb 29, 2012","id":17,"title":"SQL Statement","url":"https://wiki.scn.sap.com/wiki/display/EIM/SQL+Statement"},{"abstracts":"What is an optimizer and why do we need it? As SAP developers, virtually all the ABAP programs we write will contain one or more Open SQL select statements … of the database. The optimizer figures out how best to retrieve data from the database by calculating the most efficient way to execute an SQL statement. While","date":"Jun 14, 2012","id":18,"title":"SQL Optimizer","url":"https://wiki.scn.sap.com/wiki/display/ABAP/SQL+Optimizer"},{"abstracts":"please follow the steps here  https://wiki.scn.sap.com/wiki/pages/viewpage.action?pageId=475496678 SAPonSQL.png SAP on SQL Server is a SCN Wiki space dedicated to provide SAP NetWeaver and MS SQL Server related content for the SAP community. Want to find MS SQL Server specific information? Find out in the SAP","date":"Aug 01, 2018","id":19,"title":"SAP on SQL Server","url":"https://wiki.scn.sap.com/wiki/display/SAPSQL/SAP+on+SQL+Server"},{"abstracts":"Support for SQL Scripts was added with version 8 of Advantage Database Server and now with version 9 we have added SQL Script Debugging. This functionality is a combination of server APIs and Advantage Data Architect integration. The SQL Debugger allows for setting break points, stepping through statements, stack","date":"Dec 19, 2015","id":20,"title":"Debugging SQL Scripts","url":"https://wiki.scn.sap.com/wiki/display/EIM/Debugging+SQL+Scripts"},{"abstracts":"SQL statement - DBversion SQL statement - DBversion","date":"Nov 14, 2017","id":21,"title":"SQL Statement - IQ_DBVersion.sql","url":"https://wiki.scn.sap.com/wiki/display/SYBIQ/Script+collection+SAP+IQ+?preview=%2F481243847%2F481243848%2FSQL+Statement+-+IQ_DBVersion.sql"},{"abstracts":"If just one column is needed we could use a sql() function as an alternative to a lookup. But the sql() function cannot be optimized in any way, it contains a string we execute, the database has to parse it, build an execution plan etc. So no tuning is possible like using pre parsed statements, parameterized sql","date":"Feb 29, 2012","id":22,"title":"sql function","url":"https://wiki.scn.sap.com/wiki/display/EIM/sql+function"},{"abstracts":"to the SAP SQL Anywhere WIKI Space. This is the SCN WIKI starting point for topics around SQL Anywhere. SQL Anywhere is a comprehensive package that provides … , and remote office environments. SQL Anywhere offers:sql-remote.pngultralite.pngmlserver128.pngengine128.png Data management technologies - SQL Anywhere provides","date":"Oct 03, 2017","id":23,"title":"SAP SQL Anywhere","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/SAP+SQL+Anywhere"},{"abstracts":"Purpose The purpose of this page is to discuss MobiLink SQL Passthrough. Introduction The new SQL Passthrough feature provides the ability for powerful and robust administration of the remote databases in a MobiLink synchronization environment. SQL Passthrough gives administrators the ability to download scripts","date":"Jul 03, 2014","id":24,"title":"MobiLink SQL Passthrough","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/MobiLink+SQL+Passthrough"},{"abstracts":"PURPOSE Here you can find important SAP notes about SQL Server (SMP/Launchpad login is required). They are divided and organized by subject. FAQs 555223 https://launchpad.support.sap.com/#/notes/555223: FAQ: Microsoft SQL Server Installation and Administration   SQL Server 2017 2492596 : Release planning","date":"Aug 01, 2018","id":25,"title":"Important SAP Notes on SQL Server","url":"https://wiki.scn.sap.com/wiki/display/SAPSQL/Important+SAP+Notes+on+SQL+Server"},{"abstracts":"SAP_AG.pngSAP® MaxDB - SQL Trace (ST05)   Moderators: Christiane Hienger http://scn.sap.com/people/christiane.hienger WIKI Space Editor: Thiago Lüttig http://scn.sap.com/people/thiago.luttig. The SQL trace logs all SQL statements that are sent to the database. See also: Traces of the SAP system","date":"Nov 23, 2015","id":26,"title":"SQL Trace (ST05)","url":"https://wiki.scn.sap.com/wiki/pages/viewpage.action?pageId=19210"},{"abstracts":"Purpose The objective of this document is to provide a list of useful SQL statements for the PI Adapter Engine (AE). These statements can be used to help troubleshoot various problems in the AE. Feel free to add your SQL statements to this list as needed. Please only add SELECT statements only. There should","date":"Dec 06, 2021","id":27,"title":"PI Adapter Engine Troubleshooting SQL Statements","url":"https://wiki.scn.sap.com/wiki/display/XI/PI+Adapter+Engine+Troubleshooting+SQL+Statements"},{"abstracts":"Purpose This wiki article describes how to silently install and uninstall SQL Anywhere Overview The silent installation and removal of the SQL Anywhere application, the SQL Anywhere documentation, and the SQL Anywhere Monitor is supported on the following Microsoft® Windows® operating systems: Microsoft","date":"May 12, 2016","id":28,"title":"Installing and Uninstalling SQL Anywhere Silently","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/Installing+and+Uninstalling+SQL+Anywhere+Silently"},{"abstracts":"Frequently Asked Questions Which SAP products are supported on SQL Server 2016? SAP support for SQL Server 2016 is restricted to the products listed in SAP Note 2201059 https://launchpad.support.sap.com/#/notes/2201059. For more information about SAP products supported on SQL Server 2016, see the Product","date":"Feb 23, 2017","id":29,"title":"FAQs about SQL Server 2016","url":"https://wiki.scn.sap.com/wiki/display/SAPSQL/FAQs+about+SQL+Server+2016"},{"abstracts":"sql-remote.pngSQL Remote is a data-replication technology designed for two-way synchronization between a consolidated database and large numbers of remote SQL Anywhere databases, typically including many mobile databases. SQL Remote uses a store-and-forward architecture to synchronize data using a file or message","date":"Dec 03, 2013","id":30,"title":"SQL Remote","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/SQL+Remote"},{"abstracts":"Overview Expensive SQL Statements Expensive SQL Statements displays detailed information about the most expensive SQL statements For a complete explanation of the rating for SQL Server - Refer to SAP Note 2021756 https://service.sap.com/sap/support/notes/2021756 - MSSQL Expensive SQL statements check. Rating","date":"Jan 04, 2021","id":31,"title":"EWA - Expensive SQL Statements","url":"https://wiki.scn.sap.com/wiki/display/SM/EWA+-+Expensive+SQL+Statements"},{"abstracts":"Purpose The purpose of this page is to discuss the Microsoft .NET Framework and how it can be integrated with SQL Anywhere. Overview SQL Anywhere offers a number of integration features with the Microsoft .NET Framework. These features are designed to make it easier for developers to work with a SQL Anywhere","date":"Jun 12, 2014","id":32,"title":"SQL Anywhere and Microsoft .NET","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/SQL+Anywhere+and+Microsoft+.NET"},{"abstracts":"Frequently Asked Questions Which SAP products are supported on SQL Server 2014? SAP supports the following SAP products on SQL Server 2014 with a few … ). For more information about SAP products supported on SQL Server 2014, see the Product Availability Matrix (PAM) at http://support.sap.com/pam","date":"Feb 23, 2017","id":33,"title":"FAQs about SQL Server 2014","url":"https://wiki.scn.sap.com/wiki/display/SAPSQL/FAQs+about+SQL+Server+2014"},{"abstracts":"Frequently Asked Questions Which SAP products are supported on SQL Server 2012? Currently, SAP supports the following SAP products on SQL Server 2012 … on SQL Server 2012, see the Product Availability Matrix (PAM) at http://support.sap.com/pam http://support.sap.com/pam. Which editions of Windows Server 2008 (R2","date":"Sep 06, 2016","id":34,"title":"FAQs about SQL Server 2012","url":"https://wiki.scn.sap.com/wiki/display/SAPSQL/FAQs+about+SQL+Server+2012"},{"abstracts":"The following tables list components that are available across each platform supported by SAP SQL Anywhere. Note that, with a few exceptions, components … and processor architecture. Information about support for a specific operating system version is located at SAP SQL Anywhere Supported Platforms and Engineering","date":"Aug 12, 2021","id":35,"title":"SAP SQL Anywhere 17 Components by Platforms","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/SAP+SQL+Anywhere+17+Components+by+Platforms"},{"abstracts":"With the release of Advantage Version 8.1, the SQL engine has been enhanced to allow developers to create User Defined Functions (UDFs) that can be used within SQL statements. These custom functions are defined inside a data dictionary and are written using SQL Persistent Stored Module code. Once the UDFs have been","date":"Dec 07, 2015","id":36,"title":"SQL User Defined Functions","url":"https://wiki.scn.sap.com/wiki/display/EIM/SQL+User+Defined+Functions"},{"abstracts":"HANA_SQL_SQLCache_Overview Display SQL cache information including evictions. Check if investigating SQL plan cache issues Input Parameters HOST PORT Output Parameters HOST:               Host name PORT:               Port CONF_GB:            Configured SQL cache size (GB) USED_GB:            Used SQL cache size","date":"May 04, 2015","id":37,"title":"HANA SQL Cache Overview","url":"https://wiki.scn.sap.com/wiki/display/SAPHANA/HANA+SQL+Cache+Overview"},{"abstracts":"Passing Values into a SQL statement Question: How can I pass values into a SQL statement that I created with the SQL Editor? See How to.. SQL Editor within Visual Composer https://www.sdn.sap.com/irj/servlet/prt/portal/prtroot/docs/library/uuid/6339e7d4-0a01-0010-1c98-db00e52e989a Migrated to Confluence 4.0","date":"Nov 28, 2006","id":38,"title":"Passing values into SQL","url":"https://wiki.scn.sap.com/wiki/display/EP/Passing+values+into+SQL"},{"abstracts":"Converts DataWindow PBSelect to ANSI SQL for use with the SQLExpert Tuning product SQLExtract.zip datawindow dw sql pbselect pb powerbuilder","date":"May 01, 2015","id":39,"title":"SQL Extract","url":"https://wiki.scn.sap.com/wiki/display/SYBPB/SQL+Extract"},{"abstracts":"Purpose The purpose of this page is to describe how to set up the SQL Anywhere Native Ruby Driver. Introduction Since version 10.0.1, SQL Anywhere has provided support for the Ruby programming language. There are three interfaces for Ruby to access a SQL Anywhere database. They are the native C driver wrapper","date":"Apr 29, 2016","id":40,"title":"Using Ruby with SQL Anywhere","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/Using+Ruby+with+SQL+Anywhere"},{"abstracts":"Purpose The purpose of this page is to discuss connecting to a SQL Anywhere Database using ADO.NET. Introduction Using the SQL Anywhere .NET Data Provider, your managed .NET applications can have integrated and strandaradized access to your SQL Anywhere database. This is the recommended method of establishing","date":"Jun 20, 2014","id":41,"title":"Connecting to a SQL Anywhere Database Using ADO.NET and the SQL Anywhere .NET Data Provider","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/Connecting+to+a+SQL+Anywhere+Database+Using+ADO.NET+and+the+SQL+Anywhere+.NET+Data+Provider"},{"abstracts":"SAP_AG.pngSAP® MaxDB - SQL Optimizer Hints   The SQL optimizer usually determines the access path on the basis of the costs (cost-based SQL optimizer). To deactivate this mechanism, you can explicitly specify hints for an SQL statement, which force a certain access path. In this section you get detailed information","date":"Dec 04, 2017","id":42,"title":"SQL Optimizer Hints","url":"https://wiki.scn.sap.com/wiki/display/MaxDB/SQL+Optimizer+Hints"},{"abstracts":"SAP SQL Anywhere is a comprehensive package providing database and synchronization technologies for server, desktop, remote office, and mobile environments. Whether you're an independent developer, or part of a corporate enterprise, we offer various editions of SQL Anywhere to meet your needs. We also make it easy","date":"Feb 10, 2020","id":43,"title":"SAP SQL Anywhere Editions","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/SAP+SQL+Anywhere+Editions"},{"abstracts":"Frequently Asked Questions Which SAP products are supported on SQL Server 2017? For release-specific information including the execptions, see SAP note 2492596 https://service.sap.com/sap/support/notes/2492596 (SMP login required). For more information about SAP products supported on SQL Server 2017, see","date":"Nov 30, 2020","id":44,"title":"FAQs about SQL Server 2017","url":"https://wiki.scn.sap.com/wiki/display/SAPSQL/FAQs+about+SQL+Server+2017"},{"abstracts":"Frequently Asked Questions Which SAP products are supported on SQL Server 2019? For release-specific information including the execptions, see SAP note  2807743 https://launchpad.support.sap.com/#/notes/2807743 (SMP login required). For more information about SAP products supported on SQL Server 2019, see","date":"Nov 30, 2020","id":45,"title":"FAQs about SQL Server 2019","url":"https://wiki.scn.sap.com/wiki/display/SAPSQL/FAQs+about+SQL+Server+2019"},{"abstracts":"                                              Required SQL Code Changes When  Migrating To ASE 15  TECHNICAL  WHITE  PAPER   www.sybase.com      Required SQL …  ........................................................................................................................... 8 Direct SQL queries joining sysdevices + sysusages .................................................................................. 10 255‐Byte","date":"Oct 02, 2014","id":46,"title":"Required SQL Changes For ASE15.pdf","url":"https://wiki.scn.sap.com/wiki/display/SYBASE/ASE+Server+Level+Performance+Tuning?preview=%2F379553293%2F393610258%2FRequired+SQL+Changes+For+ASE15.pdf"},{"abstracts":"the process of bringing them into SQL Server.   Overview This page will link to two other child wiki pages.  One of them will show the steps that are involved in installing the sample AdventureWorks database onto SQL Server 2008 R2.  The other will show the steps that are involved in installing the sample","date":"Apr 20, 2017","id":47,"title":"Where to Find and How to Install the Sample Adventureworks Database and Cube onto SQL Server and SQL Server Analysis Services","url":"https://wiki.scn.sap.com/wiki/display/BOBJ/Where+to+Find+and+How+to+Install+the+Sample+Adventureworks+Database+and+Cube+onto+SQL+Server+and+SQL+Server+Analysis+Services"},{"abstracts":"PURPOSE Provide a list of known issues with error samples so customers can find possible solution to database errors found during SQL operations. OVERVIEW An issue belongs to this topic, if it is related with any database errors (usually with ABAP dump) during an SQL operation (e.g. insert, update, select etc","date":"Aug 19, 2016","id":48,"title":"Database errors during SQL operations","url":"https://wiki.scn.sap.com/wiki/display/SAPSQL/Database+errors+during+SQL+operations"},{"abstracts":"Advantage has several tools and features that can help you optimize your SQL statements for the best possible performance. Performance was a major focus for the Advantage 8.0 release and will continue to be a focus for future releases. A very useful tool when optimizing queries is the Advantage SQL Execution Plan","date":"Dec 18, 2015","id":49,"title":"Viewing the Advantage SQL Execution Plan","url":"https://wiki.scn.sap.com/wiki/display/EIM/Viewing+the+Advantage+SQL+Execution+Plan"},{"abstracts":"In BI4.1 Crystal for Enterprise now has the ability to do Freehand SQL, which was supported in Crystal Reports 2011. Select a new connection 1figaddsql.png Enter Freehand SQL 2enterfreehandsql.png Then drag fields over for reporting 3startreporting.png Migrated to Confluence 4.0","date":"Jun 16, 2013","id":50,"title":"Freehand SQL","url":"https://wiki.scn.sap.com/wiki/display/BOBJ/Freehand+SQL"},{"abstracts":"7.3     -> Troubleshooting -> Database Open SQL Browser.jpg    select 'Open Settings Diallog' (7.1) or Column List / Search Condition (7.3) to specify selection criteria,  e.g., Open SQL Browser_columns.jpg   Open SQL Browser_selection criteria.jpg   Open SQL Browser_general.jpg   nwa_pi","date":"Jan 10, 2013","id":51,"title":"Open SQL Data Browser","url":"https://wiki.scn.sap.com/wiki/display/XI/Open+SQL+Data+Browser"},{"abstracts":"Advantage has several tools and features that can help you optimize your SQL statements to get the best possible performance. New to Advantage 8.0 … resources and could impact performance. Additionally, it logs the text of the SQL statement, which could pose potential security issues. Essentially query logging","date":"Dec 11, 2015","id":52,"title":"SQL Tools","url":"https://wiki.scn.sap.com/wiki/display/EIM/SQL+Tools"},{"abstracts":"OVERVIEW You want to use SQL Statement History to gather further information about the SQL statements which have produced high load on the server in the past. USAGE DBACockpit -> Performance folder -> History folder -> SQL Statement History ssh.png You can find the SQL Statement History in SAP systems with MS","date":"Sep 06, 2016","id":53,"title":"SQL Statement History","url":"https://wiki.scn.sap.com/wiki/display/SAPSQL/SQL+Statement+History"},{"abstracts":"HANA_SQL_SQLCache_Overview_Rev70+   Display SQL cache information including evictions. Can be used if investing SQL plan cache issues. Input Parameters HOST PORT Output Parameters HOST:               Host name PORT:               Port CONF_GB:            Configured SQL cache size (GB) USED_GB:            Used","date":"May 04, 2015","id":54,"title":"HANA SQL Cache Overview Rev70+","url":"https://wiki.scn.sap.com/wiki/pages/viewpage.action?pageId=413238270"},{"abstracts":"infrastructure problems are often incorrectly classified as a database problem, the source of networking errors is almost always not from either SQL Server or client … , SQL Server ERRORLOG, developer traces or Java system logs. Error conditions such as hanging client processes; a process which is doing no work and cannot","date":"Feb 10, 2017","id":55,"title":"General Network errors on SQL Server","url":"https://wiki.scn.sap.com/wiki/display/SAPSQL/General+Network+errors+on+SQL+Server"},{"abstracts":"Microsoft SQL Server https://answers.sap.com/tags/891349005586930604519575996418053 SQL Server 2016 https://answers.sap.com/topics/sql+server+2016.html SQL Server 2014 https://answers.sap.com/topics/sql+server+2014.html  ","date":"Jul 28, 2017","id":56,"title":"Microsoft SQL Server Tags","url":"https://wiki.scn.sap.com/wiki/display/SAPSQL/Microsoft+SQL+Server+Tags"},{"abstracts":"SAP SQL Anywhere components by platform tables are available for the following versions:   SAP SQL Anywhere 17 https://wiki.scn.sap.com/wiki/display/SSAstage/SAP+SQL+Anywhere+17.0+Components+by+Platforms SAP SQL Anywhere 16 https://wiki.scn.sap.com/wiki/display/SSAstage/SAP+SQL+Anywhere+16.0+Components","date":"Nov 29, 2016","id":57,"title":"SAP SQL Anywhere Components by Platform","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/SAP+SQL+Anywhere+Components+by+Platform"},{"abstracts":"Use SQL commands executed: <number>, avg. <number> per second   Explanation Here you find statistics about the throughput of SQL statements on the system. The <number> values may be helpful to compare different situations on different days.   User Response   More Information Relevant  DB-Analyzer Files","date":"Sep 06, 2018","id":58,"title":"SQL Commands","url":"https://wiki.scn.sap.com/wiki/display/MaxDB/SQL+Commands"},{"abstracts":"a really good job in providing an open SQL based interface to CDC. Database CDC methods are not standardized and hence need to be implemented natively for each database, often for each database version. DataServices for example has the code for Oracle CDC http://wiki.sdn.sap.com/wiki/x/04I_E and SQL Server","date":"Feb 29, 2012","id":59,"title":"SQL Server 2008 CDC","url":"https://wiki.scn.sap.com/wiki/display/EIM/SQL+Server+2008+CDC"},{"abstracts":"Purpose The purpose of this page is to show how to debug possible connectivity problems to SQL Anywhere database.  Common Connectivity Issues Invalid … the same enviroment e.g. LD_LIBRARY_PATH , $PATH, needs to be set with sa_config.sh ) Running multiple versions of SQL Anywhere binaries on the same machine","date":"Sep 14, 2016","id":60,"title":"How to Troubleshoot Connections to SQL Anywhere","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/How+to+Troubleshoot+Connections+to+SQL+Anywhere"},{"abstracts":"Documentation is available for the following SQL Anywhere versions and languages:   SQL Anywhere Version Languages Download Link SQL Anywhere 17.0 English German French Japanese Simplified Chinese https://wiki.scn.sap.com/wiki/x/dD67Gg https://wiki.scn.sap.com/wiki/x/dD67Gg SQL Anywhere 16.0 English","date":"Jan 31, 2018","id":61,"title":"SAP SQL Anywhere Documentation Download","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/SAP+SQL+Anywhere+Documentation+Download"},{"abstracts":"Purpose The purpose of this guide is to explain how to optimally tune sql plan cache in HANA in order to help overcome the high number of execution plan evictions and recompiliations What is SQL PLAN CACHE? SQL Plan Cache is an area allocated in memory where the execution plans of sql queries are parsed and stored","date":"Jan 15, 2021","id":62,"title":"Guide to Tuning SQL Plan Cache","url":"https://wiki.scn.sap.com/wiki/display/SAPHANA/Guide+to+Tuning+SQL+Plan+Cache"},{"abstracts":"Shared sql area is used to store the frequently accessed tables, element and SQL statements. It consists of DD cache and Sql Cache. DB Buffer: It is used to store the content i.e. fetched from the database, it has its own size -          DB Buffer size should large enough to hold the user request data","date":"May 09, 2012","id":63,"title":"Shared Sql area","url":"https://wiki.scn.sap.com/wiki/display/ABAP/Shared+Sql+area"},{"abstracts":"SAP Knowledge Base Article Symptom l Setting Filter_In_From to Yes with Ansi92 = yes should push where clause to the from clause in SQL generation l An extra \"and\" is appended to the end of the sql  statement  Environment l SAP BusinessObjects Business Intelligence platform 4.0 SP4 l Information Design Tool","date":"Apr 30, 2013","id":64,"title":"Kbase 1853636 IDT FILTER_IN_FROM SQL Error.pdf","url":"https://wiki.scn.sap.com/wiki/display/BOBJ/Using+Filter_In_From+in+Universe+Parameters?preview=%2F318439906%2F334594082%2FKbase+1853636+IDT+FILTER_IN_FROM+SQL+Error.pdf"},{"abstracts":"Purpose This article describes the process required to transfer a MySQL database to  SQL Anywhere database. Overview Migrating data from MySQL to SQL Anywhere can be a straightforward process if there are not a lot of MySQL extensions in use within your database and application. SQL Anywhere simplifies migration","date":"Jun 20, 2014","id":65,"title":"Migrating a MySQL Database to SQL Anywhere 16","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/Migrating+a+MySQL+Database+to+SQL+Anywhere+16"},{"abstracts":"Introduction Sybase produces several distinct database server products, including Adaptive Server Enterprise (ASE), SQL Anywhere, UltraLite and UltraLiteJ, SQL Advantage Server, and Sybase IQ. This wiki considers the migration of applications from SQL Anywhere to Adaptive Server Enterprise (ASE). The SQL Anywhere","date":"Jul 11, 2014","id":66,"title":"Migrating SQL Anywhere database applications to ASE","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/Migrating+SQL+Anywhere+database+applications+to+ASE"},{"abstracts":"to the database and what is executed inside the engine. Using the menu \"Display Optimized SQL\" DI will show all SQLs being sent to the database. It could be plain reading of the table like in the case where a caches is filled, you can see joins, group by's, etc. In or case, we can see that three SQLs are being sent","date":"Mar 05, 2012","id":67,"title":"Display Optimized SQL","url":"https://wiki.scn.sap.com/wiki/display/EIM/Display+Optimized+SQL"},{"abstracts":"_NavBar_Win   _SideBar1     To install the SQL Server Client As a prerequisite, SQL Server Client must have been installed on VANTGVMWINPB04 and VANTGVMWINPB05. To verify this, you must be logged into Windows with an Administrator account. 1)      In Windows, go to the SQL Server 2008 R2 Setup","date":"May 17, 2013","id":68,"title":"Installing the SQL Server middleware","url":"https://wiki.scn.sap.com/wiki/display/BOBJ/Installing+the+SQL+Server+middleware"},{"abstracts":"Introduction Migrating data from PostgreSQL to SQL Anywhere can be a straightforward process if there are not a lot of PostgreSQL extensions in use within your database and application. SQL Anywhere simplifies migration by including built-in tools that facilitate a smooth transition from PostgreSQL (and other RDBMS’s","date":"Jul 10, 2014","id":69,"title":"Migrating a PostgreSQL Database to SQL Anywhere 12","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/Migrating+a+PostgreSQL+Database+to+SQL+Anywhere+12"},{"abstracts":"PURPOSE The purpose of this document is to clarify about the access to the download media of SQL Server. SQL Server 2005 DVD has been archived! (new 19/07/2016) The SQL Server 2005 DVD from SAP Launchpad has been archived. If you (1) have a system already running on SQL Server 2005, (2) have acquired SQL","date":"Nov 14, 2016","id":70,"title":"SQL Server Installation Media for SAP NetWeaver products","url":"https://wiki.scn.sap.com/wiki/display/SAPSQL/SQL+Server+Installation+Media+for+SAP+NetWeaver+products"},{"abstracts":"Use This section provides information about the upgrade of SQL Server 2005, SQL Server 2008 (R2), or SQL Server 2012 system to SQL Server 2014 in an existing non-high-availability system. Prerequisites You must follow the instructions of the Upgrade to and Installation of SQL Server 2014 in an SAP Environment 1","date":"Apr 22, 2020","id":71,"title":"Health Check after SQL Server 2014 upgarde","url":"https://wiki.scn.sap.com/wiki/display/SAPSQL/Health+Check+after+SQL+Server+2014+upgarde"},{"abstracts":"Purpose The purpose of this page is to discuss MobiLink synchronization with ASE and SQL Anywhere. Overview This paper demonstrates how to synchronize data between an Adaptive Server Enterprise (ASE) consolidated database and SQL Anywhere remote databases. It shows how to set up a simple synchronization from","date":"Feb 10, 2015","id":72,"title":"MobiLink Synchronization with ASE and SQL Anywhere","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/MobiLink+Synchronization+with+ASE+and+SQL+Anywhere"},{"abstracts":"Purpose The purpose of this page is to illustrate how SQL Anywhere supports Unicode. Overview SQL Anywhere supports Unicode. In particular: SQL Anywhere supports the UTF-8 character encoding for Unicode, using the UTF8 collation. The SQL Anywhere ODBC driver, OLE DB provider, and ADO.NET Data Provider","date":"Jun 27, 2014","id":73,"title":"SQL Anywhere and Unicode","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/SQL+Anywhere+and+Unicode"},{"abstracts":"Purpose SQL Anywhere 12 contains a number of integration features with Microsoft Visual Studio 2008 and 2010. These features are designed to make it easier to work with a SQL Anywhere database while developing an application using Visual Studio. This wiki outlines the integration features that are present for Visual","date":"Jul 07, 2014","id":74,"title":"SQL Anywhere 12 Integration with Visual Studio 2010","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/SQL+Anywhere+12+Integration+with+Visual+Studio+2010"},{"abstracts":"OVERVIEW This document guide describe the options and technical requirements to access an external MS SQL Server database. There are different connection types which depend on the purpose you want to perform the connection for. You need to access data locate in an external SQL Server database, with the SAP system","date":"Nov 02, 2015","id":75,"title":"Remote MS SQL Server database connections","url":"https://wiki.scn.sap.com/wiki/display/SAPSQL/Remote+MS+SQL+Server+database+connections"},{"abstracts":"Purpose The purpose of this wiki is to show how SQL Anywhere 12 integrates with Visual Studio 2008 Overview SQL Anywhere 12 contains a number of integration features with Microsoft Visual Studio 2008 and 2010. These features are designed to make it easier to work with a SQL Anywhere database while developing","date":"Jul 04, 2014","id":76,"title":"SQL Anywhere 12 Integration with Visual Studio 2008","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/SQL+Anywhere+12+Integration+with+Visual+Studio+2008"},{"abstracts":"rebuilding a replicating database. Replicating databases are databases that are part of a system that uses either SQL Remote or MobiLink technology. When … attempting these changes on your production databases. This tutorial outlines the steps for rebuilding a database. SQL Anywhere 10 is used for this technical document","date":"Mar 11, 2016","id":77,"title":"Rebuilding a SQL Anywhere Database","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/Rebuilding+a+SQL+Anywhere+Database"},{"abstracts":"Purpose The purpose of this page is to provide instructions for updating the SQL Anywhere Oracle (formerly Sun) Java Runtime Environment (JRE). Overview … of the JRE are not required and do not affect the stability or performance of SQL Anywhere. *** Note that the SAP JRE is now shipped with SQL Anywhere instead","date":"Dec 04, 2014","id":78,"title":"Updating the SQL Anywhere Oracle Java Runtime Environment","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/Updating+the+SQL+Anywhere+Oracle+Java+Runtime+Environment"},{"abstracts":" but have been removed.   SQL Server Columnstore for SAP https://www.sap.com/documents/2019/04/023e5928-487d-0010-87a3-c30de2ffd8ff.html This blog introduces concepts, implementation and optimization of SQL Server Columnstore for SAP BW&ERP.  Max Degree of Parallelism Option in SQL Server 2012 and higher","date":"Apr 20, 2020","id":79,"title":"Recently Featured Content in the SAP on SQL Server Community","url":"https://wiki.scn.sap.com/wiki/display/SAPSQL/Recently+Featured+Content+in+the+SAP+on+SQL+Server+Community"},{"abstracts":"SQL Anywhere Security Option With the exception of Advanced Encryption Standard (AES) and simple database encryption, which is included with the base package of SQL Anywhere, all encryption requires one of the following separately licensed security options.   SQL Anywhere FIPS Security Option - Order #18768","date":"Sep 19, 2016","id":80,"title":"SAP SQL Anywhere 16 Separately Licensed Components","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/SAP+SQL+Anywhere+16+Separately+Licensed+Components"},{"abstracts":"Frequently Asked Questions Which SAP Products Are Supported On SQL Server 2008 (R2)? SAP supports the following SAP products on SQL Server 2008 (R2): SAP … SAP note 1076022 http://service.sap.com/sap/support/notes/1076022. For more information about SAP products supported on SQL Server 2008 (R2), see the Product","date":"Sep 06, 2016","id":81,"title":"FAQs about SQL Server 2008 (R2)","url":"https://wiki.scn.sap.com/wiki/pages/viewpage.action?pageId=448467834"},{"abstracts":"Here you find the most viewed SAP on SQL Server presentations: Whitepaper SAP on SQL Server 2012 and SQL Server 2014: Best Practices for High Availability … NetWeaver and Microsoft SQL Server 2012 https://wiki.scn.sap.com/wiki/x/wCm7Gg SAP DBA Cockpit and Microsoft SQL Server https://sap.na.pgiconnect.com/p49554994/","date":"Mar 24, 2017","id":82,"title":"The SAP on SQL Server Most Viewed Presentations","url":"https://wiki.scn.sap.com/wiki/display/SAPSQL/The+SAP+on+SQL+Server+Most+Viewed+Presentations"},{"abstracts":"Purpose This is a guide on SQL Server Report Service and how to setup this tool with SAP SDK Drivers.   Overview SQL Server Report Service is a Microsoft tool found in the SQL Server installation.  This tool is used to build reports and run queries off of a database to fill in the information.  This tool can only","date":"Jun 15, 2016","id":83,"title":"SQL Server Report Services or SSRS","url":"https://wiki.scn.sap.com/wiki/display/SYBCON/SQL+Server+Report+Services+or+SSRS"},{"abstracts":"Microsoft released SQL Server 2012 in March 2012. This document introduces several new features of SQL Server 2012 that are helpful for SAP NetWeaver customers. This document is only relevant for SAP applications based on SAP NetWeaver. It focuses on the features of SQL Server 2012 that benefit these applications","date":"Sep 14, 2016","id":84,"title":"SAP NetWeaver and Microsoft SQL Server 2012","url":"https://wiki.scn.sap.com/wiki/display/SAPSQL/SAP+NetWeaver+and+Microsoft+SQL+Server+2012"},{"abstracts":"Purpose The purpose of this page is to review the fundamentals of encryption and how to configure table encryption for a SQL Anywhere version 10 or later database. Overview Encryption is a security tool used to protect information from people who are not authorized to view it. SQL Anywhere introduced strong","date":"Jun 12, 2014","id":85,"title":"Using SQL Anywhere Table Encryption","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/Using+SQL+Anywhere+Table+Encryption"},{"abstracts":"SAP_AG.pngSAP® MaxDB - Terminology of SQL Optimizer   This section introduces you to the performance analysis terms of the SQL optimizer. WIKI Space Editor: Thiago Lüttig http://scn.sap.com/people/thiago.luttig.     An understanding of the way the SQL optimizer works is prerequisite","date":"Sep 09, 2016","id":86,"title":"Terminology of SQL Optimizer","url":"https://wiki.scn.sap.com/wiki/display/MaxDB/Terminology+of+SQL+Optimizer"},{"abstracts":"with identity columns actually? DI adds them into the insert statement, even if they have a NULL value and SQL Server complaints. It wouldn't be a problem if SQL Server would look at the column value, figure there is a NULL value and hence ignore the column by itself. But no, the logic for SQL Server is: Identity column has","date":"Feb 29, 2012","id":87,"title":"SQL Server Identity column","url":"https://wiki.scn.sap.com/wiki/display/EIM/SQL+Server+Identity+column"},{"abstracts":"cloud128.png SAP SQL Anywhere, on-demand edition is a data management solution that enables independent software vendors (ISVs) to take business applications to the cloud and offer software as a service (SaaS). ISVs can build, deploy, and manage large cloud applications. SQL Anywhere, on-demand edition offers","date":"Jan 14, 2014","id":88,"title":"SQL Anywhere on-demand edition","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/SQL+Anywhere+on-demand+edition"},{"abstracts":"In this section you will find examples of SQL scripts for common problems that can be used with SQL Anywhere.","date":"Sep 14, 2016","id":89,"title":"SQL Script Examples","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/SQL+Script+Examples"},{"abstracts":"With the release of Advantage Database Server version 7.0, several important improvements have been made to the SQL engine.  These improvements fall into three … or more.  These enhancements can also improve the speed of UNION, DISTINCT and ORDER BY operations. New Grammar Support 1) The Advantage SQL Engine now","date":"Nov 17, 2015","id":90,"title":"Advantage SQL Enhancements","url":"https://wiki.scn.sap.com/wiki/display/EIM/Advantage+SQL+Enhancements"},{"abstracts":"Purpose The purpose of this page is to provide an introduction to using PHP and SQL Anywhere to create web applications with rich dynamic content … . SQL Anywhere installed on th esame computer as the web server. The client software can be used as well. SQL Anywhere PHP extension Installing a Web Server","date":"Jun 12, 2014","id":91,"title":"Getting Started with SAP SQL Anywhere and PHP","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/Getting+Started+with+SAP+SQL+Anywhere+and+PHP"},{"abstracts":"Purpose The purpose of this page is to discuss migration of your SQL Remote for ASE Environment to MobiLink. Overview This document assumes that you have a working knowledge of SQL Remote for ASE, but not necessarily MobiLink. Much of the verbosity of this document, particularly in the code samples, is to ensure","date":"Jun 11, 2014","id":92,"title":"Migrating SQL Remote for ASE Environment to MobiLink","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/Migrating+SQL+Remote+for+ASE+Environment+to+MobiLink"},{"abstracts":"Purpose This purpose for this page is help with specify what situations the SQL queries from SAP Note 1969700 https://service.sap.com/sap/support/notes/1969700 - SQL statement collection for SAP HANA can be used to help troubleshoot an issue. High CPU HANA_Workload HANA_Resources_CPUAndMemory_History","date":"May 05, 2015","id":93,"title":"SQL Queries Collection","url":"https://wiki.scn.sap.com/wiki/display/SAPHANA/SQL+Queries+Collection"},{"abstracts":"system administrators can use the DBA Cockpit for local monitoring and analysis of Microsoft SQL Server systems. Each presentation includes a PowerPoint with audible narration. SAP DBA Cockpit and Microsoft SQL Server https://sap.na.pgiconnect.com/p49554994/ (Session recording, August 2011) This presentation by Leslie","date":"Feb 13, 2017","id":94,"title":"The SAP DBA Cockpit and Microsoft SQL Server","url":"https://wiki.scn.sap.com/wiki/display/SAPSQL/The+SAP+DBA+Cockpit+and+Microsoft+SQL+Server"},{"abstracts":"Purpose The purpose of this page is to provide a sample of the SQL Anywhere .NET External Environment which launches the Microsoft .NET Common Language Runtime (CLR) from the SQL Anywhere database server. Overview In this example, the database server executes .NET functions that call the two methods defined","date":"Jul 17, 2014","id":95,"title":"Using the SQL Anywhere .NET External Environment","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/Using+the+SQL+Anywhere+.NET+External+Environment"},{"abstracts":"SAP_AG.pngSAP® MaxDB - Poor Performance when executing Individual SQL Statements   Moderator: Birgit Malik http://scn.sap.com/people/birgit.malik WIKI Space Editor: Thiago Lüttig http://scn.sap.com/people/thiago.luttig   If the runtime of individual SQL statements is unsatisfactory, you have","date":"Dec 13, 2019","id":96,"title":"Poor Performance when executing Individual SQL Statements","url":"https://wiki.scn.sap.com/wiki/display/MaxDB/Poor+Performance+when+executing+Individual+SQL+Statements"},{"abstracts":"Purpose The purpose of this page is to discuss blocking in SAP SQL Anywhere 10 or later. Information regarding connection options that control blocking … . In SQL Anywhere, blocking occurs when one connection holds a lock on a specific row or table at the same time a second connection attempts to acquire a lock","date":"Nov 19, 2014","id":97,"title":"How to Debug Blocking in SQL Anywhere","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/How+to+Debug+Blocking+in+SQL+Anywhere"},{"abstracts":"Purpose To demonstrate how ‘parameters’ can be used with SQL() function. Overview The SQL() function does not allow 'Parameters' to be used in the rule … SQL() in rules is not advised due to performance issues with issuing the SQL command for every row.  If there is another means to achieve your desired results","date":"Apr 27, 2016","id":98,"title":"Using parameters in SQL() function within a rule","url":"https://wiki.scn.sap.com/wiki/display/EIM/Using+parameters+in+SQL%28%29+function+within+a+rule"},{"abstracts":"Purpose The purpose of this wiki is to describe the new features introduced in SQL Anywhere 12.0.1 Overview SQL Anywhere is the leading data management and enterprise synchronization solution for applications that operate outside the traditional data center. From its inception, SQL Anywhere was designed to deliver","date":"Jul 07, 2014","id":99,"title":"SQL Anywhere 12.0.1 New Features Summary","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/SQL+Anywhere+12.0.1+New+Features+Summary"},{"abstracts":"Purpose The purpose of this page is to describe how database application developers can use SQL Anywhere and the ADO.NET Entity Framework (EF) to build … in the EDM, the developer provides only the tables that are relevant to the application. Database application developers can use SQL Anywhere to take advantage","date":"Nov 02, 2017","id":100,"title":"Using SQL Anywhere and the ADO.NET Entity Framework","url":"https://wiki.scn.sap.com/wiki/display/SQLANY/Using+SQL+Anywhere+and+the+ADO.NET+Entity+Framework"}]